JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_sinc.h
/*
 * Copyright 2022 NXP
 *
 * All rights reserved.
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_SINC_H_
#define _FSL_SINC_H_

#include "fsl_common.h"

/*!
 * @addtogroup sinc
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief lower_component_name driver version 2.0.0. */
#define FSL_SINC_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

#define SINC_INTERRUPT_NORMAL              (8ULL)
#define SINC_INTERRUPT_ERROR               (0ULL)
#define SINC_INTERRUPT_FIFO_CAD            (1ULL)
#define SINC_ENCODE_INTERRUPT(type, value) (((uint64_t)(value)) << ((uint64_t)(type) << 2ULL))

/*!
 * @brief The enumeration of SINC module's interrupts.
 * @anchor sinc_interrupt_enable_t
 */
enum _sinc_interrupt_enable
{
    /* Normal interrupts enable. */
    /* Enable the conversion complete interrupt for channel 0. */
    kSINC_CH0ConvCompleteIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIE_COCIE0_MASK),
    /* Enable the conversion complete interrupt for channel 1. */
    kSINC_CH1ConvCompleteIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIE_COCIE1_MASK),
    /* Enable the conversion complete interrupt for channel 2. */
    kSINC_CH2ConvCompleteIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIE_COCIE2_MASK),
    /* Enable the conversion complete interrupt for channel 3. */
    kSINC_CH3ConvCompleteIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIE_COCIE3_MASK),

    /* Enable the data output ready interrupt for channel 0. */
    kSINC_CH0DataReadyIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIE_CHFIE0_MASK),
    /* Enable the data output ready interrupt for channel 1. */
    kSINC_CH1DataReadyIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIE_CHFIE1_MASK),
    /* Enable the data output ready interrupt for channel 2. */
    kSINC_CH2DataReadyIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIE_CHFIE2_MASK),
    /* Enable the data output ready interrupt for channel 3. */
    kSINC_CH3DataReadyIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIE_CHFIE3_MASK),

    /* Enable the zero cross detected interrupt for channel 0. */
    kSINC_CH0ZeroCrossDetectedIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIE_ZCDIE0_MASK),
    /* Enable the zero cross detected interrupt for channel 1. */
    kSINC_CH1ZeroCrossDetectedIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIE_ZCDIE1_MASK),
    /* Enable the zero cross detected interrupt for channel 2. */
    kSINC_CH2ZeroCrossDetectedIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIE_ZCDIE2_MASK),
    /* Enable the zero cross detected interrupt for channel 3. */
    kSINC_CH3ZeroCrossDetectedIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIE_ZCDIE3_MASK),

    /* Error interrupts enable. */
    /* Enable the short circuit detected interrupt for channel 0. */
    kSINC_CH0SCDIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_SCDIE0_MASK),
    /* Enable the short circuit detected interrupt for channel 1. */
    kSINC_CH1SCDIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_SCDIE1_MASK),
    /* Enable the short circuit detected interrupt for channel 2. */
    kSINC_CH2SCDIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_SCDIE2_MASK),
    /* Enable the short circuit detected interrupt for channel 3. */
    kSINC_CH3SCDIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_SCDIE3_MASK),

    /* Enable the window limit interrupt for channel 0. */
    kSINC_CH0WindowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_WLMTIE0_MASK),
    /* Enable the window limit interrupt for channel 1. */
    kSINC_CH1WindowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_WLMTIE1_MASK),
    /* Enable the window limit interrupt for channel 2. */
    kSINC_CH2WindowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_WLMTIE2_MASK),
    /* Enable the window limit interrupt for channel 3. */
    kSINC_CH3WindowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_WLMTIE3_MASK),

    /* Enable the low limit interrupt for channel 0. */
    kSINC_CH0LowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_LLMTIE0_MASK),
    /* Enable the low limit interrupt for channel 1. */
    kSINC_CH1LowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_LLMTIE1_MASK),
    /* Enable the low limit interrupt for channel 2. */
    kSINC_CH2LowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_LLMTIE2_MASK),
    /* Enable the low limit interrupt for channel 3. */
    kSINC_CH3LowLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_LLMTIE3_MASK),

    /* Enable the high limit interrupt for channel 0. */
    kSINC_CH0HighLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_HLMTIE0_MASK),
    /* Enable the high limit interrupt for channel 1. */
    kSINC_CH1HighLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_HLMTIE1_MASK),
    /* Enable the high limit interrupt for channel 2. */
    kSINC_CH2HighLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_HLMTIE2_MASK),
    /* Enable the high limit interrupt for channel 3. */
    kSINC_CH3HighLimitIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIE_HLMTIE3_MASK),

    /* FIFO and CAD(clock-absence detector) Error interrupts enable. */
    /* Enable the FIFO underflow interrupt for channel 0. */
    kSINC_CH0FifoUnderflowIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_FUNFIE0_MASK),
    /* Enable the FIFO underflow interrupt for channel 1. */
    kSINC_CH1FifoUnderflowIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_FUNFIE1_MASK),
    /* Enable the FIFO underflow interrupt for channel 2. */
    kSINC_CH2FifoUnderflowIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_FUNFIE2_MASK),
    /* Enable the FIFO underflow interrupt for channel 3. */
    kSINC_CH3FifoUnderflowIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_FUNFIE3_MASK),

