JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_sinc.h
    /* Enable the FIFO overflow interrupt for channel 0. */
    kSINC_CH0FifoOverflowIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_FOVFIE0_MASK),
    /* Enable the FIFO overflow interrupt for channel 1. */
    kSINC_CH1FifoOverflowIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_FOVFIE1_MASK),
    /* Enable the FIFO overflow interrupt for channel 2. */
    kSINC_CH2FifoOverflowIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_FOVFIE2_MASK),
    /* Enable the FIFO overflow interrupt for channel 3. */
    kSINC_CH3FifoOverflowIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_FOVFIE3_MASK),

    /* Enable the clock absence interrupt for channel 0. */
    kSINC_CH0CADIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_CADIE0_MASK),
    /* Enable the clock absence interrupt for channel 1. */
    kSINC_CH1CADIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_CADIE1_MASK),
    /* Enable the clock absence interrupt for channel 2. */
    kSINC_CH2CADIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_CADIE2_MASK),
    /* Enable the clock absence interrupt for channel 3. */
    kSINC_CH3CADIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_CADIE3_MASK),

    /* Enable the saturation interrupt for channel 0. */
    kSINC_CH0SaturationIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_SATIE0_MASK),
    /* Enable the saturation interrupt for channel 1. */
    kSINC_CH1SaturationIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_SATIE1_MASK),
    /* Enable the saturation interrupt for channel 2. */
    kSINC_CH2SaturationIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_SATIE2_MASK),
    /* Enable the saturation interrupt for channel 3. */
    kSINC_CH3SaturationIntEnable = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIE_SATIE3_MASK),
};

/*!
 * @brief The enumeration of SINC interrupt status flags.
 * @anchor sinc_interrupt_status_t
 */
enum _sinc_interrupt_status
{
    /* Normal interrupts status. */
    /* One conversion has finished and data is available in channel 0. */
    kSINC_CH0ConvCompleteIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIS_COC0_MASK),
    /* One conversion has finished and data is available in channel 1. */
    kSINC_CH1ConvCompleteIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIS_COC1_MASK),
    /* One conversion has finished and data is available in channel 2. */
    kSINC_CH2ConvCompleteIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIS_COC2_MASK),
    /* One conversion has finished and data is available in channel 3. */
    kSINC_CH3ConvCompleteIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIS_COC3_MASK),

    /* The FIFO of channel 0 has exceeded its watermark level and the data is available in channel 0 result register. */
    kSINC_CH0DataReadyIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIS_CHF0_MASK),
    /* The FIFO of channel 1 has exceeded its watermark level and the data is available in channel 1 result register. */
    kSINC_CH1DataReadyIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIS_CHF1_MASK),
    /* The FIFO of channel 2 has exceeded its watermark level and the data is available in channel 2 result register. */
    kSINC_CH2DataReadyIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIS_CHF2_MASK),
    /* The FIFO of channel 3 has exceeded its watermark level and the data is available in channel 3 result register. */
    kSINC_CH3DataReadyIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIS_CHF3_MASK),

    /* The resulting data on channel 0 crossed zero and changed sign. */
    kSINC_CH0ZeroCrossDetectedIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIS_ZCD0_MASK),
    /* The resulting data on channel 1 crossed zero and changed sign. */
    kSINC_CH1ZeroCrossDetectedIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIS_ZCD1_MASK),
    /* The resulting data on channel 2 crossed zero and changed sign. */
    kSINC_CH2ZeroCrossDetectedIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIS_ZCD2_MASK),
    /* The resulting data on channel 3 crossed zero and changed sign. */
    kSINC_CH3ZeroCrossDetectedIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_NORMAL, SINC_NIS_ZCD3_MASK),

    /* Error interrupts Status. */
    /* SINC detected a short circuit on channel 0. */
    kSINC_CH0SCDIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_SCD0_MASK),
    /* SINC detected a short circuit on channel 1. */
    kSINC_CH1SCDIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_SCD1_MASK),
    /* SINC detected a short circuit on channel 2. */
    kSINC_CH2SCDIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_SCD2_MASK),
    /* SINC detected a short circuit on channel 3. */
    kSINC_CH3SCDIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_SCD3_MASK),

    /* Indicates channel 0 exceeded its window limit. */
    kSINC_CH0WindowLimitIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_WLMT0_MASK),
    /* Indicates channel 1 exceeded its window limit. */
    kSINC_CH1WindowLimitIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_WLMT1_MASK),
    /* Indicates channel 2 exceeded its window limit. */
    kSINC_CH2WindowLimitIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_WLMT2_MASK),
    /* Indicates channel 3 exceeded its window limit. */
    kSINC_CH3WindowLimitIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_WLMT3_MASK),

    /* Indicates channel 0 exceeded its low limit. */
    kSINC_CH0LowLimitIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_LLMT0_MASK),
    /* Indicates channel 1 exceeded its window limit. */
    kSINC_CH1LowLimitIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_LLMT1_MASK),
    /* Indicates channel 2 exceeded its window limit. */
    kSINC_CH2LowLimitIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_LLMT2_MASK),
    /* Indicates channel 3 exceeded its window limit. */
    kSINC_CH3LowLimitIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_LLMT3_MASK),

    /* Indicates channel 0 exceeded its high limit. */
    kSINC_CH0HighLimitIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_HLMT0_MASK),
    /* Indicates channel 1 exceeded its high limit. */
    kSINC_CH1HighLimitIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_HLMT1_MASK),
    /* Indicates channel 2 exceeded its high limit. */
    kSINC_CH2HighLimitIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_HLMT2_MASK),
    /* Indicates channel 3 exceeded its high limit. */
    kSINC_CH3HighLimitIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_ERROR, SINC_EIS_HLMT3_MASK),

    /* FIFO and CAD(clock-absence detector) Error interrupts Status. */
    /* A FIFO underflow occurred on channel 0. */
    kSINC_CH0FifoUnderflowIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_FUNF0_MASK),
    /* A FIFO underflow occurred on channel 1. */
    kSINC_CH1FifoUnderflowIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_FUNF1_MASK),
    /* A FIFO underflow occurred on channel 2. */
    kSINC_CH2FifoUnderflowIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_FUNF2_MASK),
    /* A FIFO underflow occurred on channel 3. */
    kSINC_CH3FifoUnderflowIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_FUNF3_MASK),

    /* A FIFO overflow occurred on channel 0. */
    kSINC_CH0FifoOverflowIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_FOVF0_MASK),
    /* A FIFO overflow occurred on channel 1. */
    kSINC_CH1FifoOverflowIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_FOVF1_MASK),
    /* A FIFO overflow occurred on channel 2. */
    kSINC_CH2FifoOverflowIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_FOVF2_MASK),
    /* A FIFO overflow occurred on channel 3. */
    kSINC_CH3FifoOverflowIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_FOVF3_MASK),

    /* SINC detected the absence of a clock on channel 0. */
    kSINC_CH0CADIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_CAD0_MASK),
    /* SINC detected the absence of a clock on channel 1. */
    kSINC_CH1CADIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_CAD1_MASK),
    /* SINC detected the absence of a clock on channel 2. */
    kSINC_CH2CADIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_CAD2_MASK),
    /* SINC detected the absence of a clock on channel 3. */
    kSINC_CH3CADIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_CAD3_MASK),

    /* Channel 0 is saturated. */
    kSINC_CH0SaturationIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_SAT0_MASK),
    /* Channel 1 is saturated. */
    kSINC_CH1SaturationIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_SAT1_MASK),
    /* Channel 2 is saturated. */
    kSINC_CH2SaturationIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_SAT2_MASK),
    /* Channel 3 is saturated. */
    kSINC_CH3SaturationIntStatus = SINC_ENCODE_INTERRUPT(SINC_INTERRUPT_FIFO_CAD, SINC_FIFOIS_SAT3_MASK),
};

/*!
 * @brief The enumeration of channel id, the sinc module contains 4 channels.
 */
typedef enum _sinc_channel_id
{
    kSINC_Channel0 = 0U, /*!< Channel 0. */
    kSINC_Channel1,      /*!< Channel 1. */
    kSINC_Channel2,      /*!< Channel 2. */
    kSINC_Channel3,      /*!< Channel 3. */
} sinc_channel_id_t;

/*!
 * @brief The enumeration of modulator clock name.
 * @anchor _sinc_modulator_clock
 */
enum _sinc_modulator_clock
{
    kSINC_ModClk0 = 1UL, /*!< Modulator Clock 0 output. */
    kSINC_ModClk1 = 2UL, /*!< Modulator Clock 1 output. */
    kSINC_ModClk2 = 4UL, /*!< Modulator Clock 2 output. */
};

/*!
 * @brief The enumeration of input clock.
 */
typedef enum _sinc_inputClk_source
{
    kSINC_InputClk_SourceMclkOut0             = 0U, /*!< MCLK_OUT0 with internal routeback. */
    kSINC_InputClk_SourceMclkOut1             = 1U, /*!< MCLK_OUT1 with internal routeback. */
    kSINC_InputClk_SourceMclkOut2             = 2U, /*!< MCLK_OUT2 with internal routeback. */
    kSINC_InputClk_SourceExternalModulatorClk = 3U, /*!< External modulator clock dedicated to the selected channel. */
    kSINC_InputClk_SourceAdjacentChannelClk   = 7U, /*!< Grouped clock shared with an adjacent channel. */
} sinc_inputClk_source_t;

/*!
 * @brief The enumeration of clock edge.
 */
typedef enum _sinc_inputClk_edge
{
    kSINC_InputClk_EdgePositive = 1U, /*!< Positive edge. */
    kSINC_InputClk_EdgeNegative,      /*!< Negative edge. */
    kSINC_InputClk_EdgeBoth,          /*!< Both edges. */
    kSINC_InputClk_EdgeOddPositive,   /*!< Every other odd positive edge. */
    kSINC_InputClk_EdgeEvenPositive,  /*!< Every other even positive edge. */
    kSINC_InputClk_EdgeOddNegative,   /*!< Every other odd negative edge. */
    kSINC_InputClk_EdgeEvenNegative,  /*!< Every other even negative edge. */
} sinc_inputClk_edge_t;

/*!
 * @brief The enumeration of input bit format.
 */
typedef enum _sinc_inputBit_format
{
    kSINC_InputBit_FormatExternalBitstream = 0U,    /*!< External bitstream from the MBIT[n] signal. */
    kSINC_InputBit_FormatExternalManchesterCode,    /*!< External Manchester code. */
    kSINC_InputBit_FormatInternal16bitParallelData, /*!< Internal 16-bit parallel data from MPDATA register. */
    kSINC_InputBit_FormatInternal32bitSerialData,   /*!< Internal 32-bit serial data from MPDATA. */
} sinc_inputBit_format_t;

/*!
 * @brief The enumeration of input bit source.
 */
typedef enum _sinc_inputBit_source
{
    kSINC_InputBit_SourceExternalBitstream = 0U, /*!< External bitstream from the MBIT[n] signal. */
    kSINC_InputBit_SourceInternalBitstream = 1U, /*!< Alternate internal bitstream from the INP[n] signal. */
    kSINC_InputBit_SourceAdjacentChannel   = 3U, /*!< Grouped bitstream shared with an adjacent chanel. */
} sinc_inputBit_source_t;

/*!
 * @brief The enumeration of trigger source.
 */
typedef enum _sinc_conv_trigger_source
{
    kSINC_ConvTrig_SoftPosEdge     = 0x0U, /*!< Positive edge software trigger. */
    kSINC_ConvTrig_SoftHighLevel   = 0x4U, /*!< High level software trigger. */
    kSINC_ConvTrig_HardPosEdge     = 0x1U, /*!< Positive edge hardware trigger. */
    kSINC_ConvTrig_HardHighLevel   = 0x5U, /*!< High level hardware trigger. */
    kSINC_ConvTrig_AdjacentChannel = 0x3U, /*!< Grouped hardware trigger shared with an adjacent channel. */
} sinc_conv_trigger_source_t;

/*!
 * @brief The enumeration of conversion mode.
 */
typedef enum _sinc_conv_mode
{
    kSINC_ConvMode_Single = 0U, /*!< One conversion that follows an edge or level trigger event. */
    kSINC_ConvMode_Continuous,  /*!< Multiple conversions that follow a triggering event, a new triggering event
                                    cancels and restarts conversion. */
    kSINC_ConvMode_Always,      /*!< Multiple conversions that follow the first triggering event, SINC ignores the
                                    next triggering event. */
    kSINC_ConvMode_FixedNumber, /*!< Fixed number conversions that follow the first triggering event, a new
                                    triggering event cancels and restarts conversion. */
} sinc_conv_mode_t;

/*!
 * @brief The enumeration of pulse trigger mux.
 */
typedef enum _sinc_pulse_trigger_mux
{
    kSINC_PulseTrigger_Disabled = 0U,              /*!< Disable pulse trigger output. */
    kSINC_PulseTrigger_MuxHighLimitLevelSignal,    /*!< Select high limit level signal for pulse trigger output. */
    kSINC_PulseTrigger_MuxLowLimitLevelSignal,     /*!< Select low limit level signal for pulse trigger output. */
    kSINC_PulseTrigger_MuxHighLowLimitLevelSignal, /*!< Select low or high limit level signal for pulse trigger output.
                                                    */
    kSINC_PulseTrigger_MuxWindowLimitLevelSignal,  /*!< Select window limit level signal for pulse trigger output. */
    kSINC_PulseTrigger_MuxZeroCrossRisingLevelSignal,  /*!< Select zero cross rising level signal for pulse trigger
                                                          output. */
    kSINC_PulseTrigger_MuxZeroCrossFallingLevelSignal, /*!< Select zero cross falling level signal for pulse trigger
                                                          output. */
    kSINC_PulseTrigger_MuxRsLimHighLevelSignal,        /*!< Select level signal that indicates a high level from an RS
                                                          flip-flop or a schmitt trigger for pulse trigger output. */
    kSINC_PulseTrigger_MuxRsLimLowLevelSignal, /*!< Select level signal that indicates a low level from an RS flip-flop
                                                  or a schmitt trigger for pulse trigger output. */
    kSINC_PulseTrigger_MuxChannelRawInputModBitStream,  /*!< Select channel raw input modulator bitstream for pulse
                                                           trigger output. */
    kSINC_PulseTrigger_MuxChannelRawInputModClock,      /*!< Select channel raw input modulator clock for pulse trigger
                                                           output. */
    kSINC_PulseTrigger_MuxChannelRecoveredModBitStream, /*!< Select channel output recovered modulator bitstream for
                                                           pulse trigger output. */
    kSINC_PulseTrigger_MuxChannelRecoveredModClock,     /*!< Select channel output recovered modulator clock for pulse
                                                           trigger output. */
    kSINC_PulseTrigger_MuxHighLimitPulseSignal,         /*!< Select high limit pulse signal for pulse trigger output. */
    kSINC_PulseTrigger_MuxLowLimitPulseSignal,          /*!< Select low limit pulse signal for pulse trigger output. */
    kSINC_PulseTrigger_MuxLimitPulseSignal, /*!< Select the pulse signal that indicates a high/low/window limit for
                                               pulse trigger output. */
    kSINC_PulseTrigger_MuxWindowLimitPulseSignal,   /*!< Select window limit pulse signal for pulse trigger output. */
    kSINC_PulseTrigger_MuxHighLowLimitPulseSignal,  /*!< Select the pulse signal that indicates a high or low limit for
                                                       pulse trigger output. */
    kSINC_PulseTrigger_MuxZeroCrossRisePulseSignal, /*!< Select zero cross rise pulse signal for trigger output. */
    kSINC_PulseTrigger_MuxZeroCrossFallPulseSignal, /*!< Select zero cross fall pulse signal for trigger output. */
    kSINC_PulseTrigger_MuxZeroCrossRiseFallPulseSignal, /*!< Select zero cross rise/fall pulse signal for trigger
                                                           output. */
    kSINC_PulseTrigger_MuxFifoWatermarkOkPulseSignal, /*!< Select FIFO watermark OK pulse signal for trigger output. */
    kSINC_PulseTrigger_MuxFifoOverflowPulseSignal,    /*!< Select FIFO overflow pulse signal. */
    kSINC_PulseTrigger_MuxFifoUnderflowPulseSignal,   /*!< Select FIFO underflow pulse signal. */
    kSINC_PulseTrigger_MuxFifoEmptyPulseSignal,       /*!< Select FIFO empty pulse signal. */
    kSINC_PulseTrigger_MuxClockMonitorAssertPulseSignal, /*!< Select clock monitor assert pulse signal. */
    kSINC_PulseTrigger_MuxShortCircuitAssertPulseSignal, /*!< Select short circuit assert pulse signal. */
    kSINC_PulseTrigger_MuxSaturationPulseSignal,         /*!< Select saturation pulse signal. */
    kSINC_PulseTrigger_MuxConversionCompletePulseSignal, /*!< Select conversion complete pulse signal. */
} sinc_pulse_trigger_mux_t;

/*!
 * @brief The enumeration of zero cross detector operate mode.
 */
typedef enum _sinc_zero_cross_operate_mode
{
    kSINC_ZCD_BothRiseAndFall = 0U, /*!< Zero cross detector operate on both rise and fall. */
    kSINC_ZCD_OnlyFall,             /*!< Zero cross detector operate on fall edge. */
    kSINC_ZCD_OnlyRise,             /*!< Zero cross detector operate on rise edge. */
    kSINC_ZCD_Disabled = 0xFU,      /*!< Zero cross detector disabled. */
} sinc_zero_cross_operate_mode_t;

/*!
 * @brief The enumeration of primary filter order.
 */
typedef enum _sinc_primary_filter_order
{
    kSINC_PF_FastSinc = 0U, /*!< Fast sinc filter, ORD is 4. */
    kSINC_PF_FirstOrder,    /*!< First order filter, ORD is 1. */
    kSINC_PF_SecondOrder,   /*!< Second order filter, ORD is 2. */
    kSINC_PF_ThirdOrder,    /*!< Third order filter, ORD is 3. */
} sinc_primary_filter_order_t;

/*!
 * @brief The enumeration of clock prescale that specify the clock divider ratio for the modulator clock.
 */
typedef enum _sinc_clock_prescale
{
    kSINC_ClkPrescale1 = 0UL, /*!< No prescale. */
    kSINC_ClkPrescale2,       /*!< Modulator clock divider ratio is 2. */
    kSINC_ClkPrescale4,       /*!< Modulator clock divider ratio is 4. */
    kSINC_ClkPrescale8,       /*!< Modulator clock divider ratio is 8. */
} sinc_clock_prescale_t;

/*!
 * @brief The enumeration of primary filter shift direction.
 */
typedef enum _sinc_primary_filter_shift_direction
{
    kSINC_PF_ShiftRight = 0U,       /*!< Right shift the raw data. */
    kSINC_PF_ShiftLeft  = 1U << 4U, /*!< Left shift the raw data. */
} sinc_primary_filter_shift_direction_t;

/*!
 * @brief The enumeration of primary filer bias sign.
 */
typedef enum _sinc_primary_filter_bias_sign
{
    kSINC_PF_BiasPositive = 0UL, /*!< The bias sign is positive. */
    kSINC_PF_BiasNegative,       /*!< The bias sign is negative. */
} sinc_primary_filter_bias_sign_t;

/*!
 * @brief The enumeration of HPF DC remover Alpha coefficient.
 */
typedef enum _sinc_primary_filter_hpf_alpha_coeff
{
    kSINC_PF_HPFAlphaCoeff0 = 0UL, /*!< Disabled HPF. */
    kSINC_PF_HPFAlphaCoeff1,       /*!< Alpha coefficient = 1 - (2^-5) */
    kSINC_PF_HPFAlphaCoeff2,       /*!< Alpha coefficient = 1 - (2^-6) */
    kSINC_PF_HPFAlphaCoeff3,       /*!< Alpha coefficient = 1 - (2^-7) */
    kSINC_PF_HPFAlphaCoeff4,       /*!< Alpha coefficient = 1 - (2^-8) */
    kSINC_PF_HPFAlphaCoeff5,       /*!< Alpha coefficient = 1 - (2^-9) */
    kSINC_PF_HPFAlphaCoeff6,       /*!< Alpha coefficient = 1 - (2^-10) */
    kSINC_PF_HPFAlphaCoeff7,       /*!< Alpha coefficient = 1 - (2^-11) */
    kSINC_PF_HPFAlphaCoeff8,       /*!< Alpha coefficient = 1 - (2^-12) */
    kSINC_PF_HPFAlphaCoeff9,       /*!< Alpha coefficient = 1 - (2^-13) */
    kSINC_PF_HPFAlphaCoeff10,      /*!< Alpha coefficient = 1 - (2^-14) */
    kSINC_PF_HPFAlphaCoeff11,      /*!< Alpha coefficient = 1 - (2^-15) */
    kSINC_PF_HPFAlphaCoeff12,      /*!< Alpha coefficient = 1 - (2^-16) */
    kSINC_PF_HPFAlphaCoeff13,      /*!< Alpha coefficient = 1 - (2^-17) */
    kSINC_PF_HPFAlphaCoeff14,      /*!< Alpha coefficient = 1 - (2^-18) */
    kSINC_PF_HPFAlphaCoeff15,      /*!< Alpha coefficient = 1 - (2^-19) */
} sin_primary_filter_hpf_alpha_coeff_t;

/*!
 * @brief The enumeration of input bit delay.
 */
typedef enum _sinc_inputBit_delay
{
    kSINC_InputBit_DelayDisabled = 0U, /*!< Input modulator bitstream delay disabled. */
    kSINC_InputBit_Delay1ClkCycle,     /*!< Input modulator bitstream delay 1 PRE_CLK cycle. */
    kSINC_InputBit_Delay2ClkCycle,     /*!< Input modulator bitstream delay 2 PRE_CLK cycle. */
    kSINC_InputBit_Delay3ClkCycle,     /*!< Input modulator bitstream delay 3 PRE_CLK cycle. */
    kSINC_InputBit_Delay4ClkCycle,     /*!< Input modulator bitstream delay 4 PRE_CLK cycle. */
    kSINC_InputBit_Delay5ClkCycle,     /*!< Input modulator bitstream delay 5 PRE_CLK cycle. */
    kSINC_InputBit_Delay6ClkCycle,     /*!< Input modulator bitstream delay 6 PRE_CLK cycle. */
    kSINC_InputBit_Delay7ClkCycle,     /*!< Input modulator bitstream delay 7 PRE_CLK cycle. */
    kSINC_InputBit_Delay8ClkCycle,     /*!< Input modulator bitstream delay 8 PRE_CLK cycle. */
    kSINC_InputBit_Delay9ClkCycle,     /*!< Input modulator bitstream delay 9 PRE_CLK cycle. */
    kSINC_InputBit_Delay10ClkCycle,    /*!< Input modulator bitstream delay 10 PRE_CLK cycle. */
    kSINC_InputBit_Delay11ClkCycle,    /*!< Input modulator bitstream delay 11 PRE_CLK cycle. */
    kSINC_InputBit_Delay12ClkCycle,    /*!< Input modulator bitstream delay 12 PRE_CLK cycle. */
    kSINC_InputBit_Delay13ClkCycle,    /*!< Input modulator bitstream delay 13 PRE_CLK cycle. */
    kSINC_InputBit_Delay14ClkCycle,    /*!< Input modulator bitstream delay 14 PRE_CLK cycle. */
    kSINC_InputBit_Delay15ClkCycle,    /*!< Input modulator bitstream delay 15 PRE_CLK cycle. */
} sinc_inputBit_delay_t;

/*!
 * @brief The enumeration of short-circuit detector operate mode.
 */
typedef enum _sinc_scd_operate_mode
{
    kSINC_Scd_OperateAtChannelEnabled = 0U, /*!< SCD operates when the channel is enabled. */
    kSINC_Scd_OperateAtConversion,          /*!< SCD operates when the PF is performing a conversion. */
    kSINC_Scd_OperateDisabled = 0xFU,       /*!< Short circuit detect is disabled. */
} sinc_scd_operate_mode_t;

/*!
 * @brief The enumeration of short-circuit detector option.
 */
typedef enum _sinc_scd_option
{
    kSINC_Scd_DetectRepeating0And1 = 0U, /*!< Both repeating 0 and 1 increment the SCD counter. */
    kSINC_Scd_DetectRepeatingOnly1,      /*!< Only repeating 1 increment the SCD counter. */
    kSINC_Scd_DetectRepeatingOnly0,      /*!< Only repeating 1 increment the SCD counter. */
} sinc_scd_option_t;

