JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_sinc.h
/*!
 * @brief The mode of limit detector.
 *
 * @note The value of each limit detector contains lot of information:
 *  bit[1:0]: limit detection options,
 *  bit[2]: low limit break signal.
 *  bit[3]: window limit break signal.
 *  bit[4]: High limit break signal.
 *  bit[7]: Enable/disable limit detector.
 */
typedef enum _sinc_limit_detector_mode
{
    kSINC_Lmt_BothHighAndLowLimit = 0x94U, /*!< Limit detector is enabled, and compare the filter sample value to high
                                            and low limit, if the value larger than high limit will trigger
                                            interrupt or break, and if the value lower than low limit will trigger
                                            interrupt or break. */
    kSINC_Lmt_OnlyHighLimit = 0x91U, /*!< Limit detector is enabled, and compare the filter sample value to high limit,
                                if the value larger than high limit will trigger interrupt or break. */
    kSINC_Lmt_OnlyLowLimit = 0x86U, /*!< Limit detector is enabled, and compare the filter sample value to low limit, if
                                the value lower than low limit will trigger interrupt or break. */
    kSINC_Lmt_WindowedValue = 0x8BU, /*!< Limit detector is enabled, and compare the filter sample value to high and low
                                 limit, if the value higher than low limit and lower than high limit will trigger
                                 interrupt or break. */
    kSINC_Lmt_Disabled = 0x0U,       /*!< Limit detector is disabled. */

} sinc_limit_detector_mode_t;

/*!
 * @brief The enumeration of clock-absence threshold.
 */
typedef enum _sinc_cad_threshold
{
    kSINC_Cad_Disabled = 0U,   /*!< Clock absence detector is disabled. */
    kSINC_Cad_Count1ClkCycle,  /*!< Clock absence detector threshold is 1 clock cycle. */
    kSINC_Cad_Count2ClkCycle,  /*!< Clock absence detector threshold is 2 clock cycle. */
    kSINC_Cad_Count3ClkCycle,  /*!< Clock absence detector threshold is 3 clock cycle. */
    kSINC_Cad_Count4ClkCycle,  /*!< Clock absence detector threshold is 4 clock cycle. */
    kSINC_Cad_Count5ClkCycle,  /*!< Clock absence detector threshold is 5 clock cycle. */
    kSINC_Cad_Count6ClkCycle,  /*!< Clock absence detector threshold is 6 clock cycle. */
    kSINC_Cad_Count7ClkCycle,  /*!< Clock absence detector threshold is 7 clock cycle. */
    kSINC_Cad_Count8ClkCycle,  /*!< Clock absence detector threshold is 8 clock cycle. */
    kSINC_Cad_Count9ClkCycle,  /*!< Clock absence detector threshold is 9 clock cycle. */
    kSINC_Cad_Count10ClkCycle, /*!< Clock absence detector threshold is 10 clock cycle. */
    kSINC_Cad_Count11ClkCycle, /*!< Clock absence detector threshold is 11 clock cycle. */
    kSINC_Cad_Count12ClkCycle, /*!< Clock absence detector threshold is 12 clock cycle. */
    kSINC_Cad_Count13ClkCycle, /*!< Clock absence detector threshold is 13 clock cycle. */
    kSINC_Cad_Count14ClkCycle, /*!< Clock absence detector threshold is 14 clock cycle. */
    kSINC_Cad_Count15ClkCycle, /*!< Clock absence detector threshold is 15 clock cycle. */
} sinc_cad_threshold_t;

#if (defined(FSL_FEATURE_SINC_CACFR_HAS_ADMASEL) && FSL_FEATURE_SINC_CACFR_HAS_ADMASEL)
/*!
 * @brief The enumeration of alternate DMA source.
 */
typedef enum _sinc_alternate_dma_source
{
    kSINC_AltDma_Disabled = 0U,        /*!< Alternate DMA disabled. */
    kSINC_AltDma_PfConvComplete,       /*!< Select PF conversion complete for alternate DMA. */
    kSINC_AltDma_PfDataOutputReady,    /*!< Select PF data output ready for alternate DMA. */
    kSINC_AltDma_ZeroCrossDetected,    /*!< Select zero crossing detected for alternate DMA. */
    kSINC_AltDma_ShortCircuitDetected, /*!< Select short circuit detected for alternate DMA. */
    kSINC_AltDma_WindowLimitDetected,  /*!< Select window limit detected for alternate DMA. */
    kSINC_AltDma_LowLimitDetected,     /*!< Select low limit detected for alternate DMA. */
    kSINC_AltDma_HighLimitDetected,    /*!< Select high limit detected for alternate DMA. */
    kSINC_AltDma_FifoUnderflow,        /*!< Select FIFO underflow detected for alternate DMA. */
    kSINC_AltDma_FifoOverflow,         /*!< Select FIFO overflow detected for alternate DMA. */
    kSINC_AltDma_ClockAbsence,         /*!< Select clock absence detected for alternate DMA. */
    kSINC_AltDma_Saturation,           /*!< Select channel saturation for alternate DMA. */
} sinc_alternate_dma_source_t;
#endif /* (defined(FSL_FEATURE_SINC_CACFR_HAS_ADMASEL) && FSL_FEATURE_SINC_CACFR_HAS_ADMASEL) */

/*!
 * @brief The enumeration of result data format.
 */
typedef enum _sinc_result_data_format
{
    kSINC_LeftJustifiedSigned = 0U, /*!< Left justified, signed. */
    kSINC_LeftJustifiedUnsigned,    /*!< Left justified, unsigned. */
} sinc_result_data_format_t;

/*!
 * @brief The enumeration of debug output.
 */
typedef enum _sinc_debug_output
{
    kSINC_Debug_PfFinalData = 0U,              /*!< Final data from PF(24 bits). */
    kSINC_Debug_OffsetData,                    /*!< Offset data(24 bits). */
    kSINC_Debug_PfShiftedData,                 /*!< Shifted data from the PF(24 bits). */
    kSINC_Debug_HpfData,                       /*!< DC remover(HPF) data(32 bits). */
    kSINC_Debug_CicRawData,                    /*!< Raw data from the PF's CIC filter. */
    kSINC_Debug_ScdHistoricalData,             /*!< Historical data from SCD. */
    kSINC_Debug_ManchesterDecoderData,         /*!< Data from the Manchester decoder. */
    kSINC_Debug_CadData,                       /*!< Data from CAD. */
    kSINC_Debug_FifoEntriesNum,                /*!< Number of available entries in the FIFO. */
    kSINC_Debug_ParallelSerialConverterStatus, /*!< Status of the parallel or serial data converter. */
} sinc_debug_output_t;

/*!
 * @brief The structure of channel input options, including input bit settings and input clock settings.
 */
typedef struct _sinc_channel_input_option
{
    sinc_inputBit_format_t inputBitFormat; /*!< Specify input bit format, please refer
                                                to @ref sinc_inputBit_format_t. */
    sinc_inputBit_source_t inputBitSource; /*!< Specify input bit source, please refer
                                                to @ref sinc_inputBit_source_t. */
    sinc_inputBit_delay_t inputBitDelay;   /*!< Specify input bit delay, please refer to @ref sinc_inputBit_delay_t. */

    sinc_inputClk_source_t inputClkSource; /*!< Specify input clock source, please refer
                                                to @ref sinc_inputClk_source_t. */
    sinc_inputClk_edge_t inputClkEdge;     /*!< Specify input clock edge, please refer to @ref sinc_inputClk_edge_t. */
} sinc_channel_input_option_t;

/*!
 * @brief The structure of channel conversion options, including CIC filter settings, HPF settings, shift settings,
 * bias settings and so on.
 */
typedef struct _sinc_channel_conv_option
{
    sinc_conv_mode_t convMode; /*!< Specify conversion mode, please refer to @ref sinc_conv_mode_t. */
    sinc_conv_trigger_source_t convTriggerSource; /*!< Specify conversion trigger source, please
                                                        refer to @ref sinc_conv_trigger_source_t. */

    bool enableChPrimaryFilter;          /*!< Enable/disable channel's primary filter. */
    sinc_primary_filter_order_t pfOrder; /*!< Specify the order of primary filter, please
                                             refer to @ref sinc_primary_filter_order_t.  */
    uint16_t u16pfOverSampleRatio;       /*!< Control primary filter's OSR, the minimum permissible value is 3,
                                             low value produce unpredictable result, the maximum permissible value depend on
                                             PF order and the desired data format, if PF order is third order and data format
                                             is signed, the maximum OSR value is 1289, if PF order is third order and data
                                             format is unsigned, the maximum OSR value is 1624, otherwise the maximum OSR
                                             value is 2047. */

    sin_primary_filter_hpf_alpha_coeff_t pfHpfAlphaCoeff; /*!< Specify HPF's alpha coeff, please
                                                              refer to @ref sin_primary_filter_hpf_alpha_coeff_t.  */

