JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_sinc.h
#if (defined(FSL_FEATURE_SINC_CACFR_HAS_ADMASEL) && FSL_FEATURE_SINC_CACFR_HAS_ADMASEL)
/*!
 * @brief Set selected channel's alternate DMA source selection.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param altDmaSource Specify the trigger source for alternate DMA, please refer to @ref sinc_alternate_dma_source_t.
 */
static inline void SINC_SetChannelAltDmaSource(SINC_Type *base,
                                               sinc_channel_id_t chId,
                                               sinc_alternate_dma_source_t altDmaSource)
{
    base->CHANNEL[(uint8_t)chId].CACFR =
        base->CHANNEL[(uint8_t)chId].CACFR & ~SINC_CACFR_ADMASEL_MASK | SINC_CACFR_ADMASEL(altDmaSource);
}
#endif /* (defined(FSL_FEATURE_SINC_CACFR_HAS_ADMASEL) && FSL_FEATURE_SINC_CACFR_HAS_ADMASEL) */

/*!
 * @brief Set selected channel's result data format.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param dataFormat Specify the result data format, please refer to @ref sinc_result_data_format_t.
 */
static inline void SINC_SetChannelResultDataFormat(SINC_Type *base,
                                                   sinc_channel_id_t chId,
                                                   sinc_result_data_format_t dataFormat)
{
    if (dataFormat == kSINC_LeftJustifiedSigned)
    {
        base->CHANNEL[(uint8_t)chId].CCFR &= ~SINC_CCFR_RDFMT_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CCFR |= SINC_CCFR_RDFMT_MASK;
    }
}

/*!
 * @brief Get the number of remaining data entries in the FIFO.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 *
 * @return The number of remaining data entries in the FIFO.
 */
static inline uint8_t SINC_GetChannelFifoCount(SINC_Type *base, sinc_channel_id_t chId)
{
    return (uint8_t)(base->CHANNEL[(uint8_t)chId].CSR & SINC_CSR_FIFOAVIL_MASK);
}

/*!
 * @brief Check whether the data in selected channel's result data register is stable when FIFO is disabled.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, refer to @ref sinc_channel_id_t for details.
 *
 * @retval true Data in selected channel's result data regiter is stable.
 * @retval false Data in selected channel's result data register is not stable.
 */
static inline bool SINC_CheckChannelResultDataReady(SINC_Type *base, sinc_channel_id_t chId)
{
    return ((base->CHANNEL[(uint8_t)chId].CSR & SINC_CSR_RDRS_MASK) != SINC_CSR_RDRS_MASK);
}

/*!
 * @brief Check whether selected channel's FIFO is empty.
 *
 * @param base SINC peripheral base address.
 * @param chId The id of sinc channel to check.
 *
 * @retval true Selected channel's FIFO is empty.
 * @retval false Selected channel's FIFO is not empty.
 */
static inline bool SINC_CheckChannelFifoEmpty(SINC_Type *base, sinc_channel_id_t chId)
{
    return ((base->SR & (SINC_SR_FIFOEMPTY0_MASK << (uint32_t)chId)) != 0UL);
}

/*! @} */

/*!
 * @name Channel Conversion Low Level Control APIs
 * @{
 */

/*!
 * @brief Trigger selected channel's conversion.
 *
 * @param base SINC peripheral base address.
 * @param chMask The mask of channels to trigger.
 */
static inline void SINC_AffirmChannelSoftwareTrigger(SINC_Type *base, uint32_t chMask)
{
    base->MCR |= chMask;
}

/*!
 * @brief Negate the trigger of selected channel.
 *
 * @param base SINC peripheral base address.
 * @param chMask The mask of channels.
 */
static inline void SINC_NegateChannelSoftwareTrigger(SINC_Type *base, uint32_t chMask)
{
    base->MCR &= ~chMask;
}

/*!
 * @brief Set selected channel's conversion mode.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param mode The conversion mode to set, please refer to @ref sinc_conv_mode_t.
 */
static inline void SINC_SetChannelConversionMode(SINC_Type *base, sinc_channel_id_t chId, sinc_conv_mode_t mode)
{
    base->CHANNEL[(uint8_t)chId].CDR = ((base->CHANNEL[(uint8_t)chId].CDR & ~SINC_CDR_PFCM_MASK) | SINC_CDR_PFCM(mode));
}

/*!
 * @brief Set selected channel's trigger source.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param triggerSource Trigger source to set, please refer to @ref sinc_conv_trigger_source_t.
 */
static inline void SINC_SetChannelTriggerSource(SINC_Type *base,
                                                sinc_channel_id_t chId,
                                                sinc_conv_trigger_source_t triggerSource)
{
    base->CHANNEL[(uint8_t)chId].CCFR =
        (((base->CHANNEL[(uint8_t)chId].CCFR) & ~(SINC_CCFR_ITLVL_MASK | SINC_CCFR_ITSEL_MASK)) |
         SINC_CCFR_ITLVL((((uint32_t)triggerSource) & 0x4UL) >> 2UL) |
         SINC_CCFR_ITSEL((uint32_t)triggerSource & 0x3UL));
}

/*!
 * @brief Set multipurpose data to selected channel.
 *
 * @note If input bit format is set as ManchesterCode, multipurpose data indicates the Manchester decoder threshold
 * value and is 11 bits width; if input bit format is set as parallel, multipurpose data indicates the parallel 16-bit
 * data and is 16 bits width; if input bit format is set as serial, multipurpose data indicates the serial data and is
 * 32 bits width.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param data Multipurpose data to set.
 */
static inline void SINC_SetChannelMultipurposeData(SINC_Type *base, sinc_channel_id_t chId, uint32_t data)
{
    base->CHANNEL[(uint8_t)chId].CMPDATA = SINC_CMPDATA_MPDATA(data);
}

/*!
 * @brief Set selected channel's PF order.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param pfOrder Primary filter order to set, please refer to @ref sinc_primary_filter_order_t
 */
static inline void SINC_SetChannelPfOrder(SINC_Type *base, sinc_channel_id_t chId, sinc_primary_filter_order_t pfOrder)
{
    base->CHANNEL[(uint8_t)chId].CDR =
        ((base->CHANNEL[(uint8_t)chId].CDR) & (~SINC_CDR_PFORD_MASK)) | (SINC_CDR_PFORD(pfOrder));
}

/*!
 * @brief Set selected channel's PF over sample rate.
 *
 * @note If PF order is third order and data format is signed, the maximum OSR value is 1289, if PF order is third
 * order and data format is unsigned, the maximum OSR value is 1624, otherwise the maximum OSR value is 2047.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param pfOsr Control the channel's PF OSR, the minimum permissible value is 3, low value produce unpredictable
 * result, the maximum permissible value depend on PF order and the desired data format.
 */
static inline void SINC_SetChannelPfOsr(SINC_Type *base, sinc_channel_id_t chId, uint16_t pfOsr)
{
    base->CHANNEL[(uint8_t)chId].CDR =
        ((base->CHANNEL[(uint8_t)chId].CDR) & (~SINC_CDR_PFOSR_MASK)) | (SINC_CDR_PFOSR(pfOsr));
}

/*!
 * @brief set selected channel's HPF DC remover Alpha coefficient.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param pfHpfAlphaCoeff Specify the HPF alpha coefficient or disable HPF as described in @ref
 * sin_primary_filter_hpf_alpha_coeff_t.
 */
static inline void SINC_SetChannelPfHpfAlphaCoeff(SINC_Type *base,
                                                  sinc_channel_id_t chId,
                                                  sin_primary_filter_hpf_alpha_coeff_t pfHpfAlphaCoeff)
{
    base->CHANNEL[(uint8_t)chId].CACFR =
        ((base->CHANNEL[(uint8_t)chId].CACFR) & (~SINC_CACFR_HPFA_MASK)) | (SINC_CACFR_HPFA(pfHpfAlphaCoeff));
}

/*!
 * @brief Set the value that shifts the PF data for the correct 24-bit precision.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param pfShiftDirection Specify the PF shift direction, including right and left.
 * @param pfShiftBitsNum Specify the PF shift value, range from 0 to 15.
 */
static inline void SINC_SetChannelPfShiftConfig(SINC_Type *base,
                                                sinc_channel_id_t chId,
                                                sinc_primary_filter_shift_direction_t pfShiftDirection,
                                                uint8_t pfShiftBitsNum)
{
    base->CHANNEL[(uint8_t)chId].CCFR = ((base->CHANNEL[(uint8_t)chId].CCFR) & (~SINC_CCFR_PFSFT_MASK)) |
                                        (SINC_CCFR_PFSFT((uint32_t)pfShiftDirection | (uint32_t)pfShiftBitsNum));
}

/*!
 * @brief Set the bias offset for the selected channel's PF.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param pfBiasSign Specify the bias sign, please refer to @ref sinc_primary_filter_bias_sign_t for details.
 * @param pfBiasValue The bias value to subtracted from the output of PF shift block, range from 0 to 0x7FFFFFUL.
 */
static inline void SINC_SetChannelPfBiasConfig(SINC_Type *base,
                                               sinc_channel_id_t chId,
                                               sinc_primary_filter_bias_sign_t pfBiasSign,
                                               uint32_t pfBiasValue)
{
    base->CHANNEL[(uint8_t)chId].CBIAS = (uint32_t)pfBiasSign << 31UL | pfBiasValue << SINC_CBIAS_BIAS_SHIFT;
}

/*!
 * @brief Enable/disable selected channel's primary filter.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param enable Used to enable primary filter:
 *          - \b true Enable channel's PF;
 *          - \b false Disable channel's PF.
 */
static inline void SINC_EnableChannelPrimaryFilter(SINC_Type *base, sinc_channel_id_t chId, bool enable)
{
    if (enable)
    {
        base->CHANNEL[(uint8_t)chId].CCR |= SINC_CCR_PFEN_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CCR &= ~SINC_CCR_PFEN_MASK;
    }
}

/*!
 * @brief Check whether selected channel's multipurpose data is ready to write parallel or serial data.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, refer to @ref sinc_channel_id_t for details.
 *
 * @retval true Selected channel's multipurpose data is ready to write parallel or serial data.
 * @retval false Selected channel's multipurpose data is not ready to write parallel or serial data.
 */
static inline bool SINC_CheckChannelParallelSerialDataReady(SINC_Type *base, sinc_channel_id_t chId)
{
    return ((base->CHANNEL[(uint8_t)chId].CSR & SINC_CSR_PSRDY_MASK) == SINC_CSR_PSRDY_MASK);
}

/*!
 * @brief Check whether primary CIC filter saturation occurred.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, refer to @ref sinc_channel_id_t for details.
 *
 * @retval true Selected channel's primary CIC filter saturation occurred.
 * @retval false Selected channel's primary CIC filter saturation did not occurred.
 */
static inline bool SINC_CheckChannelPrimaryCICSaturation(SINC_Type *base, sinc_channel_id_t chId)
{
    return ((base->CHANNEL[(uint8_t)chId].CSR & SINC_CSR_PFSAT_MASK) == SINC_CSR_PFSAT_MASK);
}

/*!
 * @brief Check whether HPF saturation occurred.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, refer to @ref sinc_channel_id_t for details.
 *
 * @retval true Selected channel's HPF saturation occurred.
 * @retval false Selected channel's HPF saturation did not occurred.
 */
static inline bool SINC_CheckChannelHPFSaturation(SINC_Type *base, sinc_channel_id_t chId)
{
    return ((base->CHANNEL[(uint8_t)chId].CSR & SINC_CSR_HPFSAT_MASK) == SINC_CSR_HPFSAT_MASK);
}

/*!
 * @brief Check whether Shift saturation occurred.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, refer to @ref sinc_channel_id_t for details.
 *
 * @retval true Selected channel's shift saturation occurred.
 * @retval false Selected channel's shift saturation did not occurred.
 */
static inline bool SINC_CheckChannelShiftSaturation(SINC_Type *base, sinc_channel_id_t chId)
{
    return ((base->CHANNEL[(uint8_t)chId].CSR & SINC_CSR_SFTSAT_MASK) == SINC_CSR_SFTSAT_MASK);
}

/*!
 * @brief Check whether bias saturation occurred.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, refer to @ref sinc_channel_id_t for details.
 *
 * @retval true Selected channel's bias saturation occurred.
 * @retval false Selected channel's bias saturation did not occurred.
 */
static inline bool SINC_CheckChannelBiasSaturation(SINC_Type *base, sinc_channel_id_t chId)
{
    return ((base->CHANNEL[(uint8_t)chId].CSR & SINC_CSR_BIASSAT_MASK) == SINC_CSR_BIASSAT_MASK);
}

/*!
 * @brief Get selected channel's number of conversions.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, refer to @ref sinc_channel_id_t for details.
 * @return uint8_t Selected channel's number of conversions.
 */
uint8_t SINC_GetChannelConversionCount(SINC_Type *base, sinc_channel_id_t chId);

/*!
 * @brief Check whether the selected channel is in conversion.
 *
 * @param base SINC peripheral base address.
 * @param chId The id of sinc channel to check.
 *
 * @retval false Selected channel conversion not in progress.
 * @retval true Selected channel conversion in progress.
 */
static inline bool SINC_CheckChannelConvProgress(SINC_Type *base, sinc_channel_id_t chId)
{
    return ((base->SR & (SINC_SR_CIP0_MASK << (uint32_t)chId)) != 0UL);
}

/*!
 * @brief Check whether the selected channel is ready for conversion.
 *
 * @param base SINC peripheral base address.
 * @param chId The id of sinc channel to check.
 *
 * @retval true Selected channel is ready for conversion.
 * @retval false Selected channel is not ready for conversion.
 */
static inline bool SINC_CheckChannelReadyForConv(SINC_Type *base, sinc_channel_id_t chId)
{
    return ((base->SR & (SINC_SR_CHRDY0_MASK << (uint32_t)chId)) != 0UL);
}

/*! @} */

/*!
 * @name Channel Protection Low Level Control APIs
 * @{
 */

/*!
 * @brief Set selected channel's low-limit threshold value.
 *
 * @note When the data exceeds the low-limit threshold value, a low-limit event occurs, and the limit threshold format
 * is determines by channel's result data format @ref sinc_result_data_format_t.
 *
 * @note Low limit value must lower than high limit value, otherwise the low-limit threshold does not work.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param lowLimitThreshold Specify the low-limit threshold value, range from 0 to 0xFFFFFFUL.
 */
static inline void SINC_SetChannelLowLimitThreshold(SINC_Type *base, sinc_channel_id_t chId, uint32_t lowLimitThreshold)
{
    base->CHANNEL[(uint8_t)chId].CLOLMT = SINC_CLOLMT_LOLMT(lowLimitThreshold);
}

/*!
 * @brief Set selected channel's high-limit threshold value.
 *
 * @note When the data exceeds the high-limit threshold value, a high-limit event occurs, and the limit threshold format
 * is determines by channel's result data format @ref sinc_result_data_format_t.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param highLimitThreshold Specify the high-limit threshold value, range from 0 to 0xFFFFFFUL.
 */
static inline void SINC_SetChannelHighLimitThreshold(SINC_Type *base,
                                                     sinc_channel_id_t chId,
                                                     uint32_t highLimitThreshold)
{
    base->CHANNEL[(uint8_t)chId].CHILMT = SINC_CHILMT_HILMT(highLimitThreshold);
}

/*!
 * @brief Set selected channel's limit detector mode.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param mode Specify the mode of limit detector, please refer to @ref sinc_limit_detector_mode_t.
 */
static inline void SINC_SetChannelLimitDetectorMode(SINC_Type *base,
                                                    sinc_channel_id_t chId,
                                                    sinc_limit_detector_mode_t mode)
{
    if (mode == kSINC_Lmt_Disabled)
    {
        base->CHANNEL[(uint8_t)chId].CCR &= ~SINC_CCR_LMTEN_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CPROT =
            (base->CHANNEL[(uint8_t)chId].CPROT & ~SINC_CPROT_LMTOP_MASK) | SINC_CPROT_LMTOP((uint32_t)mode & 0x3UL);
        base->CHANNEL[(uint8_t)chId].CCR |= SINC_CCR_LMTEN_MASK;
    }
}

/*!
 * @brief Enable/disable selected channel's high limit break signal.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param enable Used to enable/disable high limit break signal:
 *          - \b true Enable the automatic assertion of the BREAK_HIGH signal when SINC detects a high-limit event on
 *                    the selected channel.
 *          - \b false Disable high limit break signal.
 */
static inline void SINC_EnableChannelHighLimitBreakSignal(SINC_Type *base, sinc_channel_id_t chId, bool enable)
{
    if (enable)
    {
        base->CHANNEL[(uint8_t)chId].CPROT |= SINC_CPROT_HLMTBK_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CPROT &= ~SINC_CPROT_HLMTBK_MASK;
    }
}

/*!
 * @brief Enable/disable selected channel's window limit break signal.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param enable Used to enable/disable window limit break signal:
 *          - \b true Enable the automatic assertion of the BREAK_WIN signal when SINC detects a window-limit event on
 *                    the selected channel.
 *          - \b false Disable window limit break signal.
 */
static inline void SINC_EnableChannelWindowLimitBreakSignal(SINC_Type *base, sinc_channel_id_t chId, bool enable)
{
    if (enable)
    {
        base->CHANNEL[(uint8_t)chId].CPROT |= SINC_CPROT_WLMTBK_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CPROT &= ~SINC_CPROT_WLMTBK_MASK;
    }
}

/*!
 * @brief Enable/disable selected channel's low limit break signal.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param enable  Used to enable/disable low limit break signal:
 *          - \b true Enable the automatic assertion of the BREAK_LOW signal when SINC detects a low-limit event on
 *                    the selected channel.
 *          - \b false Disable low limit break signal.
 */
static inline void SINC_EnableChannelLowLimitBreakSignal(SINC_Type *base, sinc_channel_id_t chId, bool enable)
{
    if (enable)
    {
        base->CHANNEL[(uint8_t)chId].CPROT |= SINC_CPROT_HLMTBK_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CPROT &= ~SINC_CPROT_HLMTBK_MASK;
    }
}

/*!
 * @brief Set selected channel's short-circuit detector operate mode.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param opMode Specify the operate mode to set, please refer to @ref sinc_scd_operate_mode_t.
 */
static inline void SINC_SetChannelScdOperateMode(SINC_Type *base,
                                                 sinc_channel_id_t chId,
                                                 sinc_scd_operate_mode_t opMode)
{
    if (opMode == kSINC_Scd_OperateDisabled)
    {
        base->CHANNEL[(uint8_t)chId].CCR &= ~SINC_CCR_SCDEN_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CPROT =
            ((base->CHANNEL[(uint8_t)chId].CPROT & ~SINC_CPROT_SCDCM_MASK) | SINC_CPROT_SCDCM(opMode));
        base->CHANNEL[(uint8_t)chId].CCR |= SINC_CCR_SCDEN_MASK;
    }
}

/*!
 * @brief Set selected channel's Scd limit threshold.
 *
 * @note The SCD counter tracks the number of received bits with the same repeating value(always 0 or always 1, set by
 * SINC_SetChannelScdOption()), if that
 * number exceeds the scdLimitThreshold, an SCD event occurs on the associated channel.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param u8ScdLimitThreshold Specify the threshold value for the SCD counter, range from 2 to 255.
 */
static inline void SINC_SetChannelScdLimitThreshold(SINC_Type *base,
                                                    sinc_channel_id_t chId,
                                                    uint8_t u8ScdLimitThreshold)
{
    assert(u8ScdLimitThreshold != 0U);
    assert(u8ScdLimitThreshold != 1U);

    base->CHANNEL[(uint8_t)chId].CPROT =
        ((base->CHANNEL[(uint8_t)chId].CPROT) & (~SINC_CPROT_SCDLMT_MASK)) | (SINC_CPROT_SCDLMT(u8ScdLimitThreshold));
}

/*!
 * @brief Set selected channel's SDC option.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param option Specify which repeating bit value increments the SCD counter.
 */
static inline void SINC_SetChannelScdOption(SINC_Type *base, sinc_channel_id_t chId, sinc_scd_option_t option)
{
    base->CHANNEL[(uint8_t)chId].CPROT =
        ((base->CHANNEL[(uint8_t)chId].CPROT) & (~SINC_CPROT_SCDOP_MASK)) | (SINC_CPROT_SCDOP(option));
}

/*!
 * @brief Enable/disable the automatic assertion of the BREAK_SCD signal when SINC detects an SCD event on the selected
 * channel.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param enable Used to enable/disable SCD break signal:
 *          - \b true Enable SCD break signal.
 *          - \b false Disable SCD break signal.
 */
static inline void SINC_EnableChannelScdBreakSignal(SINC_Type *base, sinc_channel_id_t chId, bool enable)
{
    if (enable)
    {
        base->CHANNEL[(uint8_t)chId].CPROT |= SINC_CPROT_SCDBK_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CPROT &= ~SINC_CPROT_SCDBK_MASK;
    }
}

/*!
 * @brief Set the threshold value for the CAD counter.
 *
 * @note The CAD counter tracks the number of clock cycles during which SINC does not detect a clock, if that number
 * exceeds the threshold value, a CAD event occurs on the selected channel.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param cadLimitThreshold Specify the threshold value for the CAD counter, please refer to @ref sinc_cad_threshold_t.
 */
static inline void SINC_SetChannelCadLimitThreshold(SINC_Type *base,
                                                    sinc_channel_id_t chId,
                                                    sinc_cad_threshold_t cadLimitThreshold)
{
    base->CHANNEL[(uint8_t)chId].CPROT =
        ((base->CHANNEL[(uint8_t)chId].CPROT) & (~SINC_CPROT_CADLMT_MASK)) | (SINC_CPROT_CADLMT(cadLimitThreshold));
    if (cadLimitThreshold == kSINC_Cad_Disabled)
    {
        base->CHANNEL[(uint8_t)chId].CCR &= ~SINC_CCR_CADEN_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CCR |= SINC_CCR_CADEN_MASK;
    }
}

