JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_sinc.h
/*!
 * @brief Enable/disable the automatic assertion of the BREAK_CAD signal when SINC detects a CAD event on the assoicated
 * channel.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param enable Used to enable/disble CAD break signal:
 *          - \b true Enable selected channel's CAD break signal;
 *          - \b false Disable selected channel's CAD break signal.
 */
static inline void SINC_EnableChannelCadBreakSignal(SINC_Type *base, sinc_channel_id_t chId, bool enable)
{
    if (enable)
    {
        base->CHANNEL[(uint8_t)chId].CPROT |= SINC_CPROT_CADBK_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CPROT &= ~SINC_CPROT_CADBK_MASK;
    }
}

/*!
 * @brief Set selected channel's zero-crossing detector operate mode.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param opMode Specify the operate mode, please refer to @ref sinc_zero_cross_operate_mode_t.
 */
static inline void SINC_SetChannelZcdOperateMode(SINC_Type *base,
                                                 sinc_channel_id_t chId,
                                                 sinc_zero_cross_operate_mode_t opMode)
{
    if (opMode == kSINC_ZCD_Disabled)
    {
        base->CHANNEL[(uint8_t)chId].CCR &= ~SINC_CCR_ZCDEN_MASK;
    }
    else
    {
        base->CHANNEL[(uint8_t)chId].CCFR =
            ((base->CHANNEL[(uint8_t)chId].CCFR) & (~SINC_CCFR_ZCOP_MASK)) | (SINC_CCFR_ZCOP(opMode));
        base->CHANNEL[(uint8_t)chId].CCR |= SINC_CCR_ZCDEN_MASK;
    }
}

/*! @} */

/*!
 * @name Channel Debug Low Level Control APIs
 * @{
 */

/*!
 * @brief Set selected channel's pulse trigger mux.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param pulseTrigMux Used to selected the signal for pulse-trigger output.
 */
static inline void SINC_SetChannelPulseTriggerMux(SINC_Type *base,
                                                  sinc_channel_id_t chId,
                                                  sinc_pulse_trigger_mux_t pulseTrigMux)
{
    base->CHANNEL[(uint8_t)chId].CACFR =
        ((base->CHANNEL[(uint8_t)chId].CACFR & ~SINC_CACFR_PTMUX_MASK) | SINC_CACFR_PTMUX(pulseTrigMux));
}

/*!
 * @brief Set selected channel's debug output.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 * @param debugOutput Used to select debug output, please refer to @ref sinc_debug_output_t.
 */
static inline void SINC_SetChannelDebugOutput(SINC_Type *base, sinc_channel_id_t chId, sinc_debug_output_t debugOutput)
{
    base->CHANNEL[(uint8_t)chId].CCR =
        ((base->CHANNEL[(uint8_t)chId].CCR & ~SINC_CCR_DBGSEL_MASK) | SINC_CCR_DBGSEL(debugOutput));
}

/*!
 * @brief Start selected channel's debug data latch proceduce.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 */
static inline void SINC_LatchChannelDebugProceduce(SINC_Type *base, sinc_channel_id_t chId)
{
    base->CHANNEL[(uint8_t)chId].CSR |= SINC_CSR_SRDS_MASK;
}

/*!
 * @brief Check if the selected channel's debug data is valid.
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 *
 * @retval true Data is valid.
 * @retval false Data is invalid.
 */
static inline bool SINC_CheckChannelDebugDataValid(SINC_Type *base, sinc_channel_id_t chId)
{
    return ((base->CHANNEL[(uint8_t)chId].CSR & (SINC_CSR_SRDS_MASK | SINC_CSR_DBGRS_MASK)) == 0UL);
}

/*!
 * @brief Return selected channel's the debug data that requested by SINC_SetChannelDebugOutput().
 *
 * @param base SINC peripheral base address.
 * @param chId Selected channel id, please refer to @ref sinc_channel_id_t.
 *
 * @return Selected channel's debug data.
 */
static inline uint32_t SINC_GetChannelDebugData(SINC_Type *base, sinc_channel_id_t chId)
{
    return base->CHANNEL[(uint8_t)chId].CDBGR;
}

/*! @} */

/*!
 * @name Interrupt Control APIs
 * @{
 */

/*!
 * @brief Enable the mask of interrupts, such as channel data ready interrupt, channel limit detect interrupt and so on.
 *
 * @param base SINC peripheral base address.
 * @param interruptMasks Mask of interrupts to enable, should be the OR'ed value of @ref sinc_interrupt_enable_t.
 */
static inline void SINC_EnableInterrupts(SINC_Type *base, uint64_t interruptMasks)
{
    base->EIE |= ((uint32_t)(interruptMasks & 0xF0F0F0FULL));
    base->FIFOIE |= ((uint32_t)((interruptMasks & 0xF0F0F0F0ULL) >> 4UL));
    base->NIE |= ((uint32_t)(interruptMasks >> 32UL) & 0xF0F0FUL);
}

/*!
 * @brief Enable the mask of interrupts, such as channel data ready interrupt, channel limit detect interrupt and so on.
 *
 * @param base SINC peripheral base address.
 * @param interruptMasks Mask of interrupts to disable, should be the OR'ed value of @ref sinc_interrupt_enable_t.
 */
static inline void SINC_DisableInterrupts(SINC_Type *base, uint64_t interruptMasks)
{
    base->EIE &= ~((uint32_t)(interruptMasks & 0xF0F0F0FULL));
    base->FIFOIE &= ~((uint32_t)((interruptMasks & 0xF0F0F0F0ULL) >> 4UL));
    base->NIE &= ~((uint32_t)(interruptMasks >> 32UL) & 0xF0F0FUL);
}

/*!
 * @brief Get interrupt status flags.
 *
 * @param base SINC peripheral base address.
 *
 * @return SINC module's interrupt status flags, the OR'ed value of @ref sinc_interrupt_status_t.
 */
static inline uint64_t SINC_GetInterruptStatus(SINC_Type *base)
{
    return (uint64_t)(((uint64_t)(base->EIS)) | ((uint64_t)(base->FIFOIS) << 4ULL) | ((uint64_t)(base->NIS) << 32ULL));
}

/*!
 * @brief Clear selected mask of interrupt status flags.
 *
 * @param base SINC peripheral base address.
 * @param statusMasks The mask of interrupt status flags to clear, should be the OR'ed
 *                    value of @ref sinc_interrupt_status_t.
 */
static inline void SINC_ClearInterruptStatus(SINC_Type *base, uint64_t statusMasks)
{
    base->EIS    = ((uint32_t)(statusMasks & 0xF0F0F0FULL));
    base->FIFOIS = ((uint32_t)((statusMasks & 0xF0F0F0F0ULL) >> 4UL));
    base->NIS    = ((uint32_t)(statusMasks >> 32UL) & 0xF0F0FUL);
}

/*! @} */

#if defined(__cplusplus)
extern "C" {
#endif

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* __FSL_SINC_H__ */
